In [16]:
import sqlite3
import csv
import pandas as pd

In [17]:
#create / access the database that stores the results table in 
conn = sqlite3.connect("golf_table.db")
cursor = conn.cursor()

In [18]:
#delete the table if it exists
cursor.execute("""DROP TABLE IF EXISTS golf_table""")

#create the table in the database 
cursor.execute("""CREATE TABLE golf_table(
                    id INTEGER PRIMARY KEY,
                    name TEXT NOT NULL,
                    total INTEGER NOT NULL,
                    round_1 INTEGER NOT NULL,
                    round_2 INTEGER NOT NULL,
                    round_3 INTEGER NOT NULL,
                    round_4 INTEGER NOT NULL);""")

In [19]:
#create the list of tuples for the data rows in the table
import random
results = []
i = 1
while i <= 70:
    round_1 = random.randint(59,80)
    round_2 = random.randint(59,80)
    round_3 = random.randint(59,80)
    round_4 = random.randint(59,80)
    total = round_1 + round_2 + round_3 + round_4
    id_num = i
    name = "Golfer " + str(id_num)
    golfer_list = (id_num, name, total, round_1, round_2, round_3, round_4)
    results.append(golfer_list)
    i += 1

In [20]:
#add list of results to the table
cursor.executemany("""INSERT INTO golf_table VALUES(?,?,?,?,?,?,?)""", results)
conn.commit()

In [21]:
#print table
df = pd.read_sql_query("""SELECT * FROM golf_table ORDER BY total;""", conn)
print(df)

    id       name  total  round_1  round_2  round_3  round_4
0   29  Golfer 29    249       63       62       62       62
1    2   Golfer 2    256       66       60       68       62
2   25  Golfer 25    258       64       64       71       59
3   36  Golfer 36    258       62       66       65       65
4   59  Golfer 59    259       62       62       67       68
..  ..        ...    ...      ...      ...      ...      ...
65  40  Golfer 40    293       76       72       66       79
66  14  Golfer 14    294       78       67       77       72
67   7   Golfer 7    295       80       71       74       70
68   5   Golfer 5    302       78       79       67       78
69  67  Golfer 67    302       73       71       79       79

[70 rows x 7 columns]

In [22]:
#print top 10 table 
top_10 = pd.read_sql_query("""SELECT name, total FROM golf_table ORDER BY total LIMIT 10;""", conn)
print(top_10)

        name  total
0  Golfer 29    249
1   Golfer 2    256
2  Golfer 25    258
3  Golfer 36    258
4  Golfer 59    259
5  Golfer 11    260
6  Golfer 52    260
7  Golfer 61    261
8  Golfer 60    264
9  Golfer 45    265